Revit 2024 API
WireSizeSet Properties
The WireSizeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Size
Returns the number of wire sizes that are in the set.
See Also
WireSizeSet Class
Autodesk.Revit.DB.Electrical Namespace